Tekla.Structures.Model.DisposableToken
System.IDisposable delegate adapter.
FinalizeOnePart());
token += new Disposable(() => FinalizeOtherPart());
return token;
}
catch
{
token.Dispose();
throw;
}
}
]]>

Tekla.Structures.Model.DisposableToken.None
The default instance that does nothing.

Tekla.Structures.Model.DisposableToken.disposed
The delegate to a method that is invoked on dispose.

Tekla.Structures.Model.DisposableToken.#ctor(System.Action)
Initializes a new instance of the Tekla.Structures.Model.DisposableToken class.
disposed: The delegate to a method that is invoked on dispose.

Tekla.Structures.Model.DisposableToken.op_Addition(Tekla.Structures.Model.DisposableToken,System.IDisposable)
Combines the two disposable objects.
a: The left hand side operand.
b: The right hand side operand.
Returns: The combined disposable object.

Tekla.Structures.Model.DisposableToken.Dispose
Invokes the callback.